app/controllers/paginas_controller.rb

  def index
    @paginas = Pagina.all
---
SELECT "paginas".* FROM "paginas"

  def create
    @pagina = Pagina.new(pagina_params)

    respond_to do |format|
      if @pagina.save
---
INSERT INTO "paginas" ("nombre", "Mensaje", "fecha", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "jola"], ["Mensaje", "que tal "], ["fecha", "2015-11-16"], ["created_at", "2015-11-16 17:11:41.033279"], ["updated_at", "2015-11-16 17:11:41.033279"]]

    def set_pagina
      @pagina = Pagina.find(params[:id])
---
SELECT  "paginas".* FROM "paginas" WHERE "paginas"."id" = ? LIMIT 1  [["id", 1]]