app/controllers/usuarios_controller.rb

  def create
    @usuario = Usuario.new(usuario_params)
@usuario.imagen = params[:file]

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("so", "imagen", "caracteristicas", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)